{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "textSize": "heading-three",
          "text": "About Enough Said"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Enough Said was a spoken word performance poetry series held weekly in Montreal, Quebec, Canada between 1994 and 1996. It provided a platform for diverse forms of literary performance and experimentation. It featured over 100 performers who improvised, read poetry from the page, or spoke it from memory; integrated technology like live radio feedback and synthesizers into their delivery; performed as \"poetry collectives\" in groups; were sometimes accompanied by live or recorded music; and did lots of other strange and provocative things under the banner of poetry and performance art. Enough Said is one of Canada's first spoken word series, and an exceptionally eclectic one. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The Enough Said events often directly or indirectly supported other literary organizations. They held space for poets to read their work published by local publishers such as The Muses' Company and DC Books, or on cassette tapes released through record label, Wired on Words; collaborated with members of the Toronto literary community such as Jill Battson and Stan Rogal; and host, Lee Gotham, began every event by promoting other literary events in the city. The wide variety of established and emerging performers as well as the connections with many other literary organizations makes the presentation of Enough Said a valuable resource for those researching the 1990's spoken word scene. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The content in this collection preserves a unique time in Montreal and Canadian history beyond the literary sphere. The memory of now defunct venues for the series—Bistro 4, Building Danse, and Fetish Cafe—in a city whose performance and nightlife venues rapidly evolve is preserved here. The series took place shortly after NAFTA was instated and before, during, and after the 1995 Referendum that narrowly voted against Quebec sovereignty, and this uncertainty looms over the series in general. More specifically, the personal grief and lack of government aid during the AIDS epidemic is documented in works by Dee Smith, Jill Battson, and the late Ian Stephens, while Endre Farkas topically laments the tensions between the United States and Canada. With its counter-cultural leanings, Enough Said and the performers therein unflinchingly tackled the unique political circumstances that surrounded them."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://raw.githubusercontent.com/spokenweb/enough-said-reading-series/refs/heads/main/about%20section%20photo%201.png",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "About the Collection",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Concordia University Special Collections now holds the Enough Said collection and works in collaboration with the SpokenWeb team in Montreal to develop it. The collection consists of twenty-two recordings from twenty Enough Said events and three compilations made by organizer Lee Gotham, as well as one oral history interview and a growing number of compilations created by SpokenWeb members for use in communal watch/annotation parties. In these parties, Enough Said performers gather online to watch and comment on the performances communally. The watch party events are interactive, informative, and often emotionally moving as they unfold. The annotations and recordings of post-watch discussions created through these activities provide new ways of understanding the collection. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The first layer of annotations on this exhibit are the AV descriptions, written by SpokenWeb research assistants throughout the collection's processing. They aim to be purely descriptive for accessibility purposes and to make it easier for researchers to find what they are looking for within the hours-long videos. The second layer of annotations is Enough Said performers' comments made during the Zoom watch parties. They treat the AV material as a jumping-off point for affective response to, or memory of, events or issues, and some of the annotations refer to things that are completely external to the AV content at hand. AV Annotate is particularly well-suited to this project because it offers the possibility of layering annotation sets of different formats and registers alongside each other, offering multiple perspectives on an AV recording at once."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Tag Rationale",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Our three tag categories are descriptive rather than interpretive. The category \"Performers and Speakers\" encapsulates those reading or performing their writing for the audience, as well as hosts announcing and audience members chatting or interacting with performers. The tags in this category are the individuals' names, or if a name is unknown, tags like \"Unknown_Reader1\" or \"Audience_Member2\" are used. The \"Watch Party Commentators\" category lists the names of the watch party attendees, who were often also performers in the series documented in the \"Performers and Speakers\" category, with a few exceptions. The multiple instances of an individual's data, whether it be their performance in 1995 or their comments on that performance in 2025, can easily be viewed simultaneously by filtering each annotation set by name."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The \"Setting and Tech\" category encapsulates most events in the AV material that are not caused by or populated with people. The \"Setting\" aspect of the tag group describes shots of the audience and the lone mic on stage. The \"Tech\" aspect denotes where edits, such as cutting out a performer's work upon their request, were made, or where periods of audio and visual static occurred. "
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "textSize": "heading-three",
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Making the Compilations",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The Enough Said events were multiple hours long, and some feature performers took the stage for over an hour. To showcase more people during the watch parties, we decided to make compilation videos. The rationale behind the videos and how we chose which performances by each performer changed each time. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The first watch party featured an abridged version of the Performance Poetry Party event, which included many of Enough Said's most regular and seasoned performers who are still very active in the literary scene today. We believe their current engagement with the wider world of poetry would make them particularly receptive to the idea of a watch party, thereby boosting engagement for an initiative we were still experimenting with. We selected around five minutes of footage or one piece from each performer's set. This piece was often the first one the individual or group performed, but some pieces were chosen due to their being particularly politically or culturally poignant or emblematic of the performance poetry leanings of the evening.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Adeena Karasick and bill bissett's close friendship and history of working together made them perfect subjects to highlight in a more intimate watch party featuring just the two of them. I chose clips that highlighted the ways in which these performers engaged with the audience to highlight the interactive aspect of performance poetry, and balanced out these humorous and eclectic works by also choosing calmer and introspective pieces to showcase the performers' emotional range. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The other two compilations with more participants were organized chronologically, with the first compilation containing clips from December 1994 to February 1995 and the second compilation focusing on February 1995 to June 1995. Far from containing all performers across the series, we chose to feature only individuals who we were introduced by their full name and engaged the most with the series' experimental performance poetry leanings. The first compilation features more homegrown talent, while the second shows how Enough Said began to attract larger national and international talent, showcasing poets from Toronto and New York and featuring more African and dub poetry stylings. "
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "textSize": "heading-three",
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Preparing for and Hosting the Watch Parties",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "We then reached out to performers within the videos—who had already been contacted by us during the rights requesting process for the publication of the videos online—to ask if they would be interested in attending a watch party. As is common with communal events, it was impossible to choose a time that worked for everyone. Some individuals were unable to make the time they initially agreed to, but also vice versa; some individuals who initially said they could not attend did come in the end. Due to the unpredictable nature of holding events with individuals spread across the globe, we believe this order of operations—making the compilation videos with varying criteria and reaching out to performers after—was the most logical way to curate this section of the project. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Between three and seven performers attended each watch party. Sometimes they knew each other very personally, perhaps having performed together in groups, and some did not know each other at all. There is an equally wide variety in the registers and topics in the watch party commentary. Surprise towards 90's fashion and quotes from lines that participants really liked are interspersed between comments about how different groups in the scene compared to each other. There are also fruitful question and answer exchanges that clarify how some of the technological experimentation took place, such as Neil Wiernick's live radio feedback. Other commenters put their heads together to work out the timeline of Corey Frost and Colin Christie's performance history. We encouraged participants to send a comment whenever they felt like it and made sure there were no limits to the scope of the information they were \"supposed to\" provide. Even simple comments like \"wow!\" offer insight into where in the recording nostalgia, surprise, and joy were elicited. The comments are variegated, but overall reflect the fun, casual nature of the series, while offering unique insights into the spoken word scene in 1990s Montreal. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://raw.githubusercontent.com/spokenweb/enough-said-reading-series/refs/heads/main/Watch%20Party%201%20Screenshot.png",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "textSize": "heading-three",
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Changes Made",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "We made changes to the AV Descriptions, recordings, and watch party transcripts, sometimes at the request of performers, but most often for technical reasons. While Enough Said took place in Montreal and many performers had French names or spoke French in their performances, at the time of upload, AV Annotate was not equipped to present French characters. All spellings have been standardized to the English alphabet. Performers had the right to ask for their performance to be excised from the recording during the rights requesting process, and a takedown notice is present at the end of the homepage instructing viewers how to request the removal of their work as it appears now. During the watch parties, we told participants they can request that some of their comments be removed or edited from the watch party transcript any time during the meeting or afterwards, and allowed them to edit the chat transcript directly before it was uploaded to AV Annotate. Both Enough Said and the watch parties have a casual and experimental air that would have suffered if all data was guaranteed to be presented online, and we want everyone to be proud of their contribution to this project. "
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "text": "",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "text": "Takedown Policy",
          "textSize": "heading-three"
        }
      ]
    },
    {
      "type": "heading-three",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "While SpokenWeb made every effort to contact all individuals featured in the above recordings to request the rights to publish this material, we were not able to contact everyone. If you are a performer in this collection who wishes to request the removal of your performance from the online exhibition and Concordia Library Special Collections, please email "
        },
        {
          "type": "link",
          "url": "mailto:spokenweb.archives@gmail.com",
          "children": [
            {
              "text": "spokenweb.archives@gmail.com"
            }
          ]
        },
        {
          "text": " and/or "
        },
        {
          "type": "link",
          "url": "mailto:jason.camlot@concordia.ca",
          "children": [
            {
              "text": "jason.camlot@concordia.ca"
            }
          ]
        },
        {
          "text": " with the name of the recording in question and your name. Sections of audio and video will be removed and replaced with a black screen with white text that reads \"# minutes of video have been removed\".\n"
        }
      ]
    }
  ],
  "title": "About the Enough Said Collection",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "about-the-enough-said-collection",
  "created_at": "2025-11-21T05:05:40.805Z",
  "created_by": "spokenweb",
  "updated_at": "2025-11-23T05:01:12.306Z",
  "updated_by": "spokenweb"
}